$(function () {

    // ----------------------------------
    // fadeIn
    // red 박스를 부드럽게 보여준다.
    // ----------------------------------
    $("#fadeIn").click(function () {
        $(".red-box").fadeIn();
    });


    // ----------------------------------
    // fadeOut
    // red 박스를 부드럽게 숨긴다.
    // ----------------------------------
    $("#fadeOut").click(function () {
        $(".red-box").fadeOut();
    });


    // ----------------------------------
    // fadeToggle
    // green 박스를
    // 숨김 / 보이기 반복
    // ----------------------------------
    $("#fadeToggle").click(function () {
        $(".green-box").fadeToggle();
    });


    // ----------------------------------
    // slideUp
    // #ffcc00 박스의 높이를
    // 부드럽게 0으로 변경
    // ----------------------------------
    $("#slideUp").click(function () {
        $(".orange-box").slideUp();
    });


    // ----------------------------------
    // slideDown
    // #ffcc00 박스를
    // 다시 높이 200px로 표시
    // ----------------------------------
    $("#slideDown").click(function () {
        $(".orange-box").slideDown();
    });


    // ----------------------------------
    // slideToggle
    // #c8ff00 박스를
    // 높이 0 ↔ 200px 반복
    // ----------------------------------
    $("#slideToggle").click(function () {
        $(".lime-box").slideToggle();
    });


    // ----------------------------------
    // ani1
    // 파란 박스를
    // 현재 위치에서 오른쪽으로 500px 이동
    // ----------------------------------
    $("#ani1").click(function () {

        $(".blue-box").stop().animate({
            left: "500px"
        }, 1000);

    });


    // ----------------------------------
    // ani2
    // 파란 박스를 원래 위치로 이동
    // ----------------------------------
    $("#ani2").click(function () {

        $(".blue-box").stop().animate({
            left: "0px"
        }, 1000);

    });

});